app/controllers/permisos_controller.rb

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
SELECT  `hardwares`.* FROM `hardwares` WHERE `hardwares`.`nserial` = 'xxx' LIMIT 1
---
  def comprobar
    idusuario =   CIPPER.decrypt(session[:idusuario])
    usu = Usuario.find(idusuario)
    serial = params[:data][:puera]
    ApplicationController.new.mqttaproved(usu,Hardware.find_by_nserial(serial))

SELECT  `hardwares`.* FROM `hardwares` WHERE `hardwares`.`nserial` = 'xxx' LIMIT 1
SELECT  `puerta`.* FROM `puerta` WHERE `puerta`.`hardware_id` = 1 LIMIT 1
INSERT INTO `permisos` (`usuario_id`, `puerta_id`, `dia_id`, `horario_id`, `created_at`, `updated_at`) VALUES (4, 1, 3, 13, '2018-02-15 05:32:35', '2018-02-15 05:32:35')
---
  def create
    puerta = Hardware.find_by_nserial(params[:hardward][:nserial]).puerta
    idUsua = CIPPER.decrypt(params[:usuario][:id])
    arrday = params[:d_ids]
    arrh = params[:h_ids]
    Permiso.where('usuario_id = ? and puerta_id = ?',idUsua.to_s,puerta.id.to_s).delete_all

    arrday.each do |dia|
      arrh.each do |hora|
        Permiso.create(usuario_id:idUsua,puerta_id:puerta.id,dia_id:dia,horario_id:hora).save