app/controllers/puertas_controller.rb

SELECT  `hardwares`.* FROM `hardwares` WHERE `hardwares`.`nserial` = 'ñadsmñamsñmañsf' LIMIT 1
SELECT  `puerta`.* FROM `puerta` WHERE `puerta`.`hardware_id` = 1 LIMIT 1
INSERT INTO `puerta` (`descr`, `empresa_id`, `hardware_id`, `created_at`, `updated_at`) VALUES ('Santander', 1, 1, '2018-02-15 04:21:25', '2018-02-15 04:21:25')
---
  def create2
    # @logocompany = file_logo(CIPPER.decrypt(session[:idempresa]))
    if session.has_key?(:idempresa)

      hardware = Hardware.find_by_nserial(params[:puerta][:serial])
      if !hardware.nil?
        if Puerta.find_by_hardware_id(hardware.id).nil?
          nuevaPuerta =  Puerta.create(descr:params[:puerta][:desc],empresa_id: CIPPER.decrypt(session[:idempresa]),hardware_id: hardware.id)

SELECT  `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 2 LIMIT 1
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`empresa_id` = 2
SELECT `horarios`.* FROM `horarios`
SELECT `dia`.* FROM `dia`
---
  def add
    if session.has_key?(:idempresa)
      @CIPPER = Gibberish::AES.new('Blast Door la lleva')
      @logocompany = file_logo(CIPPER.decrypt(session[:idempresa]))
      @datosusuarios = Empresa.find(CIPPER.decrypt(session[:idempresa])).usuarios
      @horarios1 = Horario.first(12)
      @horarios2 = Horario.limit(12).offset(12)
      @horarios3 = Horario.limit(12).offset(24)
      @horarios4 = Horario.last(12)
      @dias = Dia.all

SELECT  `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
SELECT `puerta`.* FROM `puerta` WHERE `puerta`.`empresa_id` = 2
---
  def get
    if session.has_key?(:idempresa)
      @CIPPER = Gibberish::AES.new('Blast Door la lleva')

      @logocompany = file_logo(CIPPER.decrypt(session[:idempresa]))
      @datospuertas = Empresa.find(CIPPER.decrypt(session[:idempresa])).puertas