app/controllers/sessions_controller.rb

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`email` = 'oscarent2@gmail.com' LIMIT 1
SELECT  `usuarios`.* FROM `usuarios` LIMIT 11
---
  def auth
   #begin
       email = params[:usuariomail][:email].to_s
       clave =params[:usuariopass].to_s
       puts clave
      usu = Usuario.find_by_email(email)
      if usu.authenticate(clave)
        puts "autentica?"
        session[:idusuario] = CIPPER.encrypt(usu.id.to_s)
        session[:idempresa] = CIPPER.encrypt(usu.empresa_id.to_s)
        case usu.role
          when "admin"
            redirect_to controller: 'metricas', action: 'get'

          when "usuario"

            redirect_to controller: 'usuario',action: if usu.pincode.blank? then 'create3' else 'pincode' end