app/controllers/usuarios_controller.rb

  def get
    @CIPPER = Gibberish::AES.new('Blast Door la lleva')


    @logocompany = file_logo(CIPPER.decrypt(session[:idempresa]))
    @datosusuario = Empresa.find(CIPPER.decrypt(session[:idempresa])).usuarios
---
SELECT  `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`empresa_id` = 2