app/controllers/usuario_controller.rb

  def create2
    empresa = CIPPER.decrypt(session[:idempresa])
    nombre = params[:usuarios][:nombre]
    apellido = params[:usuarios][:apellido]
    email = params[:usuarios][:email]
    cargo = params[:usuarios][:cargo]
    tel = params[:usuarios][:telefono]
    ntarjeta = params[:usuarios][:tarjeta]
    pass = generate_activation_code
    newuser = Usuario.create(nombre: nombre,ntarjeta: ntarjeta,email:email, apellido: apellido, password: pass, password_confirmation: pass, role: "usuario", empresa_id: empresa, cargo: cargo, telefono: tel)
      if newuser.valid?
        begin
          newuser.save

          flash[:notice] =  'Cuenta guardada'
          UsuarioNotificacionMailer.send_signup_email(newuser,pass).deliver
          redirect_to :controller => 'usuarios', :action => 'get'

        rescue
            redirect_to :controller => 'usuarios', :action => 'get'


        end
      else
        flash[:notice] = newuser.errors.messages.map { |k,v| v }.join('<br>').html_safe
---
INSERT INTO `usuarios` (`nombre`, `email`, `apellido`, `cargo`, `telefono`, `role`, `password_digest`, `empresa_id`, `created_at`, `updated_at`) VALUES ('oos', 'oscar.plaza@techo.org', 'oks', 'Niño techo', '51214050', 'usuario', '$2a$10$fDkPJepW20H/iUruAedEMuAcxFMGnOOP0Jvte4cfGkglTl4V7l5Nm', 1, '2018-02-14 19:38:55', '2018-02-14 19:38:55')
SELECT `usuarios`.* FROM `usuarios` WHERE (email = 'oscarent2@gmail.com' AND empresa_id = '1')