app/views/puertas/get.html.erb

SELECT  `hardwares`.* FROM `hardwares` WHERE `hardwares`.`puerta_id` = 2 LIMIT 1
SELECT COUNT(DISTINCT `permisos`.`usuario_id`) FROM `permisos` WHERE `permisos`.`puerta_id` = 1
---

        <td data-toggle="modal" data-target="#myModal4<%=Hardware.find(item.hardware_id).nserial%>" style="cursor: pointer;"> <%= item.descr%>  </td>
        <td data-toggle="modal" data-target="#myModal4<%=Hardware.find(item.hardware_id).nserial%>" style="cursor: pointer;"><%= Hardware.find(item.hardware_id).nserial %></td>
        <td data-toggle="modal" data-target="#myModal4<%=Hardware.find(item.hardware_id).nserial%>" style="cursor: pointer;"><%=Permiso.where(puerta_id: "#{item.id}").distinct.count(:usuario_id)%></td>